#include "Stage1.h"


void Stage1::PrintMap()
{
	/* Piece 1 */
	CONPOS(0, 2) << "戍";
	CONPOS(0, 5) << "戍";
	CONPOS(2, 2) << "式忖";
	CONPOS(2, 3) << "式戌式式式式式忖";
	CONPOS(2, 4) << "式式式式式式式弛";
	CONPOS(2, 5) << "式式式式式式式戎";

	/* Piece 2 */
	CONPOS(8, 0) << "成";
	CONPOS(28, 0) << "成";
	CONPOS(8, 1) << "戌式式式式式忖式式式弛";
	CONPOS(20, 2) <<            "弛式式式弛";
	CONPOS(20, 3) <<            "弛式式式弛";
	CONPOS(20, 4) <<            "弛式式式弛";
	CONPOS(20, 5) <<            "弛式式式弛";
	CONPOS(20, 6) <<            "戌式式式戎";

	/* Piece 3 */
	CONPOS(4, 7)  << "忙式式式式式忖";
	CONPOS(4, 8)  << "弛式式式式式戌式式式式式式式忖";
	CONPOS(4, 9)  << "弛式式式式式式式式式式式式式弛";
	CONPOS(4, 10) << "弛式式式式式式式式式式式式式弛";
	CONPOS(4, 11) << "弛式式式式式式式式式式式式式弛";
	CONPOS(4, 12) << "弛式式忙式式式式式忖";
	CONPOS(4, 13) << "弛式式弛";
	CONPOS(4, 14) << "弛式式弛";
	CONPOS(4, 15) << "戌式式戎";
	CONPOS(24, 12) <<                    "式式式式弛";
	CONPOS(22, 13) <<                  "戌式式式式戎";

	/* Piece 4 */
	CONPOS(0, 17) << "戍";
	CONPOS(0, 25) << "戍";
	CONPOS(14, 14) <<             "忙式忖";
	CONPOS(14, 15) <<             "弛式戌式式式式式式式忖";
	CONPOS(14, 16) <<             "弛式式式式式式式式式弛";
	CONPOS(2, 17)  << "式式式式式式戎式式式式式式式式式弛";
	CONPOS(2, 18)  << "式式式式式式式式式式式式式式式式弛";
	CONPOS(2, 19)  << "式式式式式式式式式式式式式式式式戌式式式式忖";
	CONPOS(2, 20)  << "式式式式式式式式式式式式式式式式式式式式式弛";
	CONPOS(2, 21)  << "式式式式式式式式式式式式式式式式式式式式式弛";
	CONPOS(2, 22)  << "式式式式式式式式式式式式式式式式式式式式式弛";
	CONPOS(2, 23)  << "式式式忙式式式式忖式式式式式式式式式式式式弛";
	CONPOS(2, 24)  << "式式式弛";
	CONPOS(2, 25)  << "式式式戎";
	CONPOS(18, 24) <<                 "戌式式式式式式式式式式式式戎";
}

Stage1::Stage1()
{
}

Stage1::~Stage1()
{
}
